import { Component, OnInit } from '@angular/core';
import {FlatTreeControl} from '@angular/cdk/tree';
import {MatTreeFlatDataSource, MatTreeFlattener} from '@angular/material/tree';

/**
 * Food data with nested structure.
 * Each node has a name and an optional list of children.
 */
 interface Mangments {
    
    ID:number;
    CentersID:number;
    mang:number;
    cod:string;
    name: string;
  }

 interface ChildNode {
  ID:number;
  cod:string;
  name: string;
  Children?: ChildNode[];
}
interface FoodNode {
    ID:number;
  //SecID:number;
  
  cod:string;
 
  name: string;
  //parent:FoodNode[];
  Children?: ChildNode[];
}

const TREE_DATA: FoodNode[] =
[{"ID":1,"cod":"100000000","name":"قطاع شئون المصلحة",
"Children":[{"ID":2,"name":"الإدارة العامة لمكتب رئيس القطاع\"3","cod":"0101000000",
"Children":[{"ID":42,"cod":null,"name":"الإدارة العامة للسياسات والإجراءات الأمنية"},
{"ID":43,"cod":null,"name":"الإدارة العامة لأمن المنشآت"},
{"ID":44,"cod":null,"name":"الإدارة العامة لأمن الأفراد"},
{"ID":45,"cod":null,"name":"الإدارة العامة لدعم أمن الجمارك"},
{"ID":46,"cod":null,"name":"الإدارة العامة لأمن المعلومات"},
{"ID":99,"cod":null,"name":"الإدارة العامة  للشئون المالية"},
{"ID":100,"cod":null,"name":"الإدارة العامة للخدمات القانونية 0"},
{"ID":101,"cod":null,"name":"1الإدارة العامة للاتصالات والعلاقات العامة 0"},
{"ID":102,"cod":null,"name":"الإدارة العامة لتنسيق البرامج 0"},
{"ID":103,"cod":null,"name":"الإدارة العامة لتخطيط القطاع0"},
{"ID":104,"cod":null,"name":"الإدارة العامة للموارد البشرية 03"},
{"ID":105,"cod":null,"name":"1الإدارة العامة للشئون الإدارية 0"},
{"ID":106,"cod":null,"name":"الادارة العامة للامن بالمنطقة الوسطى والجنوبيه"},
{"ID":107,"cod":null,"name":"الإدارة العامة لقياس الاداء والاحصاء 0"},{"ID":128,"cod":null,"name":"1-ادارة الشئون المالية"},{"ID":130,"cod":null,"name":"1-ادارة الشئون الادارية"},{"ID":131,"cod":null,"name":"1-ادارة الموارد البشرية"},{"ID":132,"cod":null,"name":"525ادارة مكتب المدير العام"},{"ID":143,"cod":null,"name":"2-ادارة الشئون المالية"},{"ID":144,"cod":null,"name":"2-ادارة الشئون الادارية"},{"ID":145,"cod":null,"name":"2-ادارة الموارد البشرية"},{"ID":146,"cod":null,"name":"531ادارة مكتب المدير العام"},{"ID":150,"cod":null,"name":"4-ادارة الشئون المالية"},{"ID":151,"cod":null,"name":"5-ادارة الشئون الادارية"},{"ID":152,"cod":null,"name":"532ادارة مكتب المدير العام"},{"ID":158,"cod":null,"name":"أدارة الدعم الفنى"},{"ID":163,"cod":null,"name":"11-ادارة تابعة لرئيس الادارة المركزية"},{"ID":166,"cod":null,"name":"6-ادارة الشئون المالية"},{"ID":167,"cod":null,"name":"7-ادارة الشئون الادارية"},{"ID":168,"cod":null,"name":"5-ادارة الموارد البشرية"},{"ID":169,"cod":null,"name":"535ادارة مكتب المدير العام"},{"ID":177,"cod":null,"name":"3-ادارة الشئون المالية"},{"ID":178,"cod":null,"name":"3-ادارة الشئون الادارية"},{"ID":179,"cod":null,"name":"3-ادارة الموارد البشرية"},{"ID":180,"cod":null,"name":"537ادارة مكتب المدير العام"},{"ID":185,"cod":null,"name":"5-ادارة الشئون المالية"},{"ID":186,"cod":null,"name":"6-ادارة الشئون الادارية"},{"ID":187,"cod":null,"name":"4-ادارة الموارد البشرية"},{"ID":188,"cod":null,"name":"539ادارة مكتب المدير العام"},{"ID":196,"cod":null,"name":"26-ادارة تابعة لرئيس الادارة المركزية"},{"ID":200,"cod":null,"name":"الادارة العامة للامن بالمنطقة الشرقيه"},{"ID":201,"cod":null,"name":"الادارة العامة للامن بالمنطقة الشماليه والغربيه"},{"ID":203,"cod":null,"name":"2ادارة نشر المعلومات"},{"ID":204,"cod":null,"name":"1ادارة نشر المعلومات"},{"ID":205,"cod":null,"name":"7-ادارة المتابعة"},{"ID":207,"cod":null,"name":"1-ادارة الحفظ"},{"ID":209,"cod":null,"name":"1-ادارة الشئون القانونية والتحقيقات"},{"ID":218,"cod":null,"name":"الادارة العامه لامن وسائل الاتصال"}]},{"ID":3,"name":"الادارة العامة للشئون المالية والادارية","cod":"0102000000","Children":[{"ID":3,"cod":null,"name":"الإدارة العامة للرأى والعقود ومراجعة التشريعات"},{"ID":8,"cod":null,"name":"الإدارة العامة لشئون مكتب الوزير"},{"ID":9,"cod":null,"name":"الإدارة العامة لدعم اتخاذ القرار"},{"ID":10,"cod":null,"name":"الإدارة العامة للمكتب الفني0"},{"ID":11,"cod":null,"name":"الإدارة العامة للمتابعة"},{"ID":26,"cod":null,"name":"الإدارة العامة لتقييم ومتابعة الأداء"},{"ID":27,"cod":null,"name":"الإدارة العامة لتحليل وتخطيط وبحوث الأداء"},{"ID":33,"cod":null,"name":"الإدارة العامة لإدارة وصيانة تكنولوجيا دعم العمليات"},{"ID":34,"cod":null,"name":"الادارة العامة لمتابعة اداء تكنولوجيا العمليات"},
{"ID":35,"cod":null,"name":"الادارة العامة لمبادرات تكنولوجيا المعلومات"},{"ID":47,"cod":null,"name":"الإدارة العامة لتخطيط وإدارة المباني"},{"ID":48,"cod":null,"name":"الإدارة العامة للأصول غير الرأسمالية"},{"ID":49,"cod":null,"name":"الإدارة العامة للشئون الإدارية"},{"ID":50,"cod":null,"name":"الإدارة العامة للمشتريات والمخازن"},{"ID":51,"cod":null,"name":"الإدارة العامة لحفظ المستندات"},{"ID":55,"cod":null,"name":"الإدارة العامة لتحليل تخطيط احتياجات التدريبية"},{"ID":56,"cod":null,"name":"الإدارة العامة لتطوير البرامج والمناهج التدريبية"},
{"ID":57,"cod":null,"name":"الإدارة العامة لتنفيذ البرامج التدريبية"},{"ID":58,"cod":null,"name":"الإدارة العامة لمتابعة وتقييم التدريب"},{"ID":65,"cod":null,"name":"الإدارة العامة للتحريات والضبط"},{"ID":66,"cod":null,"name":"الإدارة العامة للتحليل والاستهداف"},{"ID":67,"cod":null,"name":"الإدارة العامة للاستخبارات"},{"ID":68,"cod":null,"name":"الإدارة العامة لمكافحة التهرب بالمنطقة الشرقية"},{"ID":69,"cod":null,"name":"الإدارة العامة لمكافحة التهرب بالمنطقة الشمالية والغربية"},{"ID":70,"cod":null,"name":"الإدارة العامة لمكافحة التهرب بالمنطقة الوسطى والجنوبية"},{"ID":79,"cod":null,"name":"الإدارة العامة للسياسات والإجراءات الجمركية"},{"ID":80,"cod":null,"name":"الإدارة العامة للمعلومات"},{"ID":108,"cod":null,"name":"الإدارة المركزية لدعم العمليات2"},{"ID":109,"cod":null,"name":"الإدارة المركزية للدعم الإداري1"},{"ID":110,"cod":null,"name":"الإدارة المركزية لجمرك إسكندرية"},{"ID":111,"cod":null,"name":"الإدارة المركزية لجمارك الدخيلة"},{"ID":112,"cod":null,"name":"الإدارة المركزية للركاب والأسواق الحرة"},{"ID":113,"cod":null,"name":"الإدارة المركزية للمنطقة الغربية"},{"ID":127,"cod":null,"name":"الادارة العامة لمكتب رئيس المنطقة"},{"ID":137,"cod":null,"name":"2-ادارة تابعة لرئيس الادارة المركزية"},{"ID":148,"cod":null,"name":"6-ادارة تابعة لرئيس الادارة المركزية"},{"ID":156,"cod":null,"name":"14-ادارة تابعة لرئيس الادارة المركزية"},{"ID":164,"cod":null,"name":"12-ادارة تابعة لرئيس الادارة المركزية"},{"ID":176,"cod":null,"name":"20-ادارة تابعة لرئيس الادارة المركزية"},{"ID":183,"cod":null,"name":"9-ادارة تابعة لرئيس الادارة المركزية"},{"ID":194,"cod":null,"name":"16-ادارة تابعة لرئيس الادارة المركزية"},{"ID":199,"cod":null,"name":"مدير اداره المكتب الفنى"},{"ID":215,"cod":null,"name":"الادارة العامة للبحوث الفنيه"}]},{"ID":4,"name":"الادارة المركزيه لشئون مكتب رئيس المصلحه","cod":"0103000000","Children":[{"ID":12,"cod":null,"name":"الإدارة العامة للعلاقات العامة"},{"ID":13,"cod":null,"name":"الإدارة العامة لخدمة المواطنين"},{"ID":14,"cod":null,"name":"الإدارة العامة للاتصالات الداخلية"},{"ID":28,"cod":null,"name":"الإدارة العامة لتخطيط الموارد البشرية"},{"ID":29,"cod":null,"name":"الإدارة العامة لتخطيط الموارد الأخرى"},{"ID":36,"cod":null,"name":"الإدارة العامة للبيانات الإحصائية"},{"ID":37,"cod":null,"name":"الإدارة العامة للأنظمة الإحصائية"},{"ID":52,"cod":null,"name":"الإدارة العامة للشئون المالية"},{"ID":53,"cod":null,"name":"الإدارة العامة للميزانية"},{"ID":54,"cod":null,"name":"الإدارة العامة للمتابعة المالية والتفويضات"},{"ID":59,"cod":null,"name":"الإدارة العامة لنظم المعلومات الإدارية"},{"ID":60,"cod":null,"name":"الإدارة العامة للمسار الوظيفي"},{"ID":61,"cod":null,"name":"الإدارة العامة لشئون العاملين"},{"ID":62,"cod":null,"name":"الإدارة العامة للعمالة والتعيينات"},{"ID":63,"cod":null,"name":"الإدارة العامة للتنظيم الإداري والتصنيف"},
{"ID":64,"cod":null,"name":"الإدارة العامة للموارد البشرية بالقطاعات"},
{"ID":71,"cod":null,"name":"الإدارة العامة لمتابعة التشغيل"},{"ID":72,"cod":null,"name":"الإدارة العامة للشئون الفنية والصيانة"},{"ID":73,"cod":null,"name":"الإدارة العامة للعمليات"},{"ID":81,"cod":null,"name":"الإدارة العامة للاتفاقيات الدولية والتعاون الدولي"},{"ID":82,"cod":null,"name":"الإدارة العامة للعلاقات الجمركية الدولية الثنائية والمتعددة0"},{"ID":83,"cod":null,"name":"الإدارة العامة للترجمة"},{"ID":84,"cod":null,"name":"الإدارة العامة للتمثيل الجمركي"},{"ID":114,"cod":null,"name":"الإدارة العامة لمكتب رئيس المنطقة"},
{"ID":115,"cod":null,"name":"الإدارة المركزية للدعم الإداري3"},
{"ID":116,"cod":null,"name":"الإدارة المركزية لجمارك ركاب مطار القاهرة الدولي"},{"ID":117,"cod":null,"name":"الإدارة المركزية لجمارك الواردات والصادرات الجوية"},{"ID":118,"cod":null,"name":"الإدارة المركزية لجمارك القاهرة"},{"ID":119,"cod":null,"name":"الإدارة المركزية لجمارك البحر الأحمر والمنطقةالجنوبية"},{"ID":126,"cod":null,"name":"الادارة المركزية لدعم العمليات"},{"ID":140,"cod":null,"name":"3-ادارة تابعة لرئيس الادارة المركزية"},{"ID":147,"cod":null,"name":"7-ادارة تابعة لرئيس الادارة المركزية"},{"ID":157,"cod":null,"name":"15-ادارة تابعة لرئيس الادارة المركزية"},{"ID":165,"cod":null,"name":"13-ادارة تابعة لرئيس الادارة المركزية"},{"ID":174,"cod":null,"name":"21-ادارة تابعة لرئيس الادارة المركزية"},{"ID":184,"cod":null,"name":"10-ادارة تابعة لرئيس الادارة المركزية"},{"ID":192,"cod":null,"name":"17-ادارة تابعة لرئيس الادارة المركزية"}]},{"ID":5,"name":"(الإدارة المركزية للعلاقات العامة والاتصالات","cod":"0104000000","Children":[{"ID":1,"cod":null,"name":"الإدارة العامة للبنية التحتية القاهره"},{"ID":2,"cod":null,"name":"الإدارة العامة للبنية التحتية بورسعيد"},{"ID":4,"cod":null,"name":"الإدارة العامة للتطبيقات القاهرة"},{"ID":5,"cod":null,"name":"الإدارة  العامة مكتب مدير إدارة شبكات الإتصالات القاهرة"},{"ID":15,"cod":null,"name":"الإدارة العامة للرأي والعقود ومراجعة التشريعات"},
{"ID":16,"cod":null,"name":"الإدارة العامة للتفتيش الفني"},{"ID":17,"cod":null,"name":"الإدارة العامة للتحقيقات والتظلمات"},{"ID":18,"cod":null,"name":"الادارة العامه للقضايا الاداريه ومجلس الدوله"},{"ID":19,"cod":null,"name":"الإدارة العامة للحجز الإداري"},{"ID":30,"cod":null,"name":"الادارة العامة لمبادرات التطوير والاصلاح الجمركى"},{"ID":31,"cod":null,"name":"الإدارة العامة لبحوث المستويات الدولية"},{"ID":32,"cod":null,"name":"الإدارة العامة للعلاقات مع الجهات المانحة"},{"ID":38,"cod":null,"name":"الإدارة العامة لتكنولوجيا الاتصالات"},{"ID":39,"cod":null,"name":"الإدارة العامة للتطبيقات"},{"ID":40,"cod":null,"name":"الإدارة العامة للدعم الفني"},{"ID":41,"cod":null,"name":"الإدارة العامة للبنية التحتية إسكندرية"},{"ID":74,"cod":null,"name":"الإدارة العامة لخدمة المتعاملين"},{"ID":75,"cod":null,"name":"الإدارة العامة لشئون المستخلصين"},{"ID":85,"cod":null,"name":"الإدارة العامة للتعريفة",},{"ID":86,"cod":null,"name":"الإدارة العامة للتقييم الجمركي"},{"ID":87,"cod":null,"name":"الإدارة العامة للمنشأ"},{"ID":120,"cod":null,"name":"الإدارة المركزية لدعم العمليات1"},{"ID":121,"cod":null,"name":"الإدارة المركزية للدعم الإداري2"},{"ID":122,"cod":null,"name":"الإدارة المركزية لجمارك دمياط",},{"ID":123,"cod":null,"name":"الإدارة المركزية  لجمرك السويس"},{"ID":124,"cod":null,"name":"الإدارة المركزية لجمرك بورسعيد"},{"ID":125,"cod":null,"name":"الإدارة المركزية لجمرك سيناء"},{"ID":129,"cod":null,"name":"الادارة العامة لمكتب رئيس المنطقه"},{"ID":139,"cod":null,"name":"4-ادارة تابعة لرئيس الادارة المركزية"},{"ID":149,"cod":null,"name":"8-ادارة تابعة لرئيس الادارة المركزية"},{"ID":175,"cod":null,"name":"22-ادارة تابعة لرئيس الادارة المركزية"},{"ID":193,"cod":null,"name":"18-ادارة تابعة لرئيس الادارة المركزية"},{"ID":216,"cod":null,"name":"12-ادارة المكتب الفنى"},{"ID":217,"cod":null,"name":"1ادارة مكتب رئيس الادارة المركزية"}]},{"ID":6,"name":"(ج) الإدارة المركزية للشئون القانونية","cod":"0105000000","Children":[{"ID":20,"cod":null,"name":"الإدارة العامة للتفتيش العام للمنطقة الشمالية والغربية"},{"ID":21,"cod":null,"name":"الإدارة العامة للتفتيش العام للمنطقة الوسطى والجنوبيه"},{"ID":22,"cod":null,"name":"الإدارة العامة للتفتيش العام للمنطقة الشرقية"},{"ID":23,"cod":null,"name":"الإدارة العامة لتقييم البرامج"},{"ID":24,"cod":null,"name":"الإدارة العامة للتفتيش العام للقطاعات الفنية"},{"ID":25,"cod":null,"name":"الإدارة العامة لمتابعة السلوك الوظيفي"},{"ID":76,"cod":null,"name":"الإدارة العامة للمراجعة اللاحقة"},
{"ID":77,"cod":null,"name":"الإدارة العامة لتحليل النشاط / العملاء"},{"ID":78,"cod":null,"name":"الإدارة العامة لأنظمة إدارة المخاطر"},{"ID":88,"cod":null,"name":"الإدارة العامة للتحكيم للمنطقة الشرقية"},{"ID":89,"cod":null,"name":"الإدارة العامة للتحكيم للمنطقة الشمالية والغربية"},{"ID":90,"cod":null,"name":"الإدارة العامة للتحكيم للمنطقة الوسطى والجنوبية"},{"ID":138,"cod":null,"name":"5-ادارة تابعة لرئيس الادارة المركزية"},{"ID":173,"cod":null,"name":"23-ادارة تابعة لرئيس الادارة المركزية"},{"ID":191,"cod":null,"name":"19-ادارة تابعة لرئيس الادارة المركزية"}]},{"ID":7,"name":"(د) الإدارة المركزية للتفتيش العام","cod":"0106000000","Children":[{"ID":6,"cod":null,"name":"ادارة البحوث الفنية للتعريفة وسطى وجنوبية"},{"ID":7,"cod":null,"name":"ادارة معالجة البيانات ونظم المعلومات وسطى وجنوبية"},{"ID":91,"cod":null,"name":"الإدارة العامة لمتابعة الإعفاءات"},{"ID":92,"cod":null,"name":"2الإدارة العامة للإعفاءات"},{"ID":93,"cod":null,"name":"الإدارة العامة للإفراج المؤقت"},{"ID":94,"cod":null,"name":"الإدارة العامة للنظم الجمركية الخاصة"},{"ID":172,"cod":null,"name":"24-ادارة تابعة لرئيس الادارة المركزية"},{"ID":202,"cod":null,"name":"المتابعه2"}]}]},{"ID":2,"cod":"200000000","name":"قطاع التخطيط الاستراتيجي والمبادرات","Children":[{"ID":1,"name":"الإدارة العامة للشئون المالية والإدارية","cod":"206000000","Children":[{"ID":95,"cod":null,"name":"الإدارة العامة  للعمليات0"},{"ID":96,"cod":null,"name":"الإدارة العامة للعملاء"},{"ID":97,"cod":null,"name":"الإدارة العامة للالتزام"},{"ID":98,"cod":null,"name":"الإدارة العامة للمتابعة والتقييم"},{"ID":133,"cod":null,"name":"1-ادارة البحوث والدراسات"},{"ID":134,"cod":null,"name":"1-ادارة الترجمة"},{"ID":135,"cod":null,"name":"ادارة مكتب المدير العام-1"},{"ID":136,"cod":null,"name":"ادارة مكتب رئيس المصلحة بالاسكندرية"},{"ID":141,"cod":null,"name":"5-ادارة المكتب الفنى"},{"ID":142,"cod":null,"name":"530ادارة مكتب المدير العام"},{"ID":153,"cod":null,"name":"12-ادارة المتابعة"},{"ID":154,"cod":null,"name":"17-ادارة المكتب الفنى"},{"ID":155,"cod":null,"name":"533ادارة مكتب المدير العام"},{"ID":159,"cod":null,"name":"ادارة التطوير والبحوث"},{"ID":160,"cod":null,"name":"8-ادارة المتابعة"},{"ID":161,"cod":null,"name":"13-ادارة المكتب الفنى"},{"ID":162,"cod":null,"name":"534ادارة مكتب المدير العام"},{"ID":170,"cod":null,"name":"25-ادارة المكتب الفنى"},{"ID":171,"cod":null,"name":"536ادارة مكتب المدير العام"},{"ID":181,"cod":null,"name":"9-ادارة المكتب الفنى"},{"ID":182,"cod":null,"name":"538ادارة مكتب المدير العام"},{"ID":189,"cod":null,"name":"20-ادارة المكتب الفنى"},{"ID":190,"cod":null,"name":"540ادارة مكتب المدير العام"},{"ID":195,"cod":null,"name":"25-ادارة تابعة لرئيس الادارة المركزية"},{"ID":197,"cod":null,"name":"أدارة العلاقات العامه والاتصالات"},{"ID":198,"cod":null,"name":"ادارة العلاقات العامةوالاتصالات"},{"ID":206,"cod":null,"name":"ادارة التنسيق والجوده"},{"ID":208,"cod":null,"name":"5-ادارة المتابعة"},
{"ID":210,"cod":null,"name":"15-ادارة المتابعة"},
{"ID":211,"cod":null,"name":"ادارة السكرتارية والحفظ بالاسكندرية"},{"ID":212,"cod":null,"name":"ادارة السكرتارية والحفظ بالقاهرة"},{"ID":213,"cod":null,"name":"ادارة البحوث القانونية بالاسكندرية"},{"ID":214,"cod":null,"name":"ادارة البحوث الفنية بالاسكندرية"},{"ID":219,"cod":null,"name":"أدارة سياسات التطبيق التنفيذى للتقييم الجمركى"},{"ID":220,"cod":null,"name":"-8أدارة المتابعه"},
{"ID":221,"cod":null,"name":"أدارة البحوث والدراسات القانونية"},{"ID":222,"cod":null,"name":"2-ادارة البحوث القانونية"},{"ID":223,"cod":null,"name":"ادارة مكتب شئون مكتب رئيس القطاع"},
{"ID":224,"cod":null,"name":"1-ادارة البيانات والمعلومات"}]},{"ID":8,"name":"الإدارة العامة لمكتب رئيس القطاع\"4","cod":"0201000000","Children":[]},{"ID":9,"name":"3الإدارة العامة للشئون المالية والإدارية\"","cod":"0202000000","Children":[]},{"ID":10,"name":"الإدارة المركزية لتخطيط وإدارة الأداء\"","cod":"0203000000","Children":[]},{"ID":11,"name":"الإدارة المركزية لتخطيط الموارد\"","cod":"0204000000","Children":[]},
{"ID":12,"name":"(ج) الإدارة المركزية للتطوير والإصلاح الجمركي","cod":"0205000000","Children":[]}]},{"ID":3,"cod":"300000000","name":"قطاع التكنولوجيا","Children":[{"ID":13,"name":"الادارة العامة لمكتب رئيس القطاع","cod":"0301000000","Children":[]},
{"ID":14,"name":"2الإدارة العامة للشئون المالية والإدارية\"","cod":"0302000000","Children":[]},{"ID":15,"name":"(أ) الإدارة المركزية لتكنولوجيا دعم العمليات الجمركية","cod":"0303000000","Children":[]},{"ID":16,"name":"(ب) الإدارة المركزية للإحصاء","cod":"0304000000","Children":[]},{"ID":17,"name":"(ج) الإدارة المركزية لتكنولوجيا المعلومات والاتصالات","cod":"0305000000","Children":[]}]},{"ID":4,"cod":"400000000","name":"قطاع الأمن والخدمات المالية والإدارية","Children":[{"ID":18,"name":"الإدارة العامة لمكتب رئيس القطاع\"5","cod":"0401000000","Children":[]},{"ID":19,"name":"(أ) الإدارة المركزية للخدمات الأمنية","cod":"0402000000","Children":[]},{"ID":20,"name":"(ب)  الإدارة المركزية للخدمات الإدارية","cod":"0403000000","Children":[]},{"ID":21,"name":"(ج) الإدارة المركزية للخدمات المالية","cod":"0404000000","Children":[]}]},{"ID":5,"cod":"500000000","name":"قطاع الموارد البشرية وبناء القدرات","Children":[{"ID":22,"name":"الإدارة العامة لمكتب رئيس القطاع\"2","cod":"0501000000","Children":[]},{"ID":23,"name":"1الإدارة العامة للشئون المالية والإدارية\"","cod":"0502000000","Children":[]},{"ID":24,"name":"(أ) الإدارة المركزية للمعهد القومي للتدريب الجمركي","cod":"0503000000","Children":[]},{"ID":25,"name":"(ب) الإدارة المركزية للموارد البشرية","cod":"0504000000","Children":[]}]},{"ID":6,"cod":"600000000","name":"قطاع الالتزام التجاري","Children":[{"ID":26,"name":"1لإدارة العامة لمكتب رئيس القطاع\"","cod":"0601000000","Children":[]},{"ID":27,"name":"\"الإدارة العامة للشئون المالية والإدارية\"","cod":"0602000000","Children":[]},{"ID":28,"name":"(أ) الإدارة المركزية لمكافحة التهرب الجمركي","cod":"0603000000","Children":[]},{"ID":29,"name":"(ب) الإدارة المركزية لتكنولوجيا الالتزام","cod":"0604000000","Children":[]},{"ID":30,"name":"(ج) الإدارة المركزية لشئون المجتمع التجاري","cod":"0605000000","Children":[]},{"ID":31,"name":"(د) الإدارة المركزية لتسهيل التجارة","cod":"0606000000","Children":[]}]},{"ID":7,"cod":"700000000","name":"قطاع النظم والإجراءات الجمركية","Children":[{"ID":32,"name":"الإدارة العامة لمكتب رئيس القطاع\"1","cod":"0701000000","Children":[]},{"ID":33,"name":"4الإدارة العامة للشئون المالية والإدارية\"","cod":"0702000000","Children":[]},{"ID":34,"name":"(أ) الإدارة المركزية للسياسات والإجراءات","cod":"0703000000","Children":[]},{"ID":35,"name":"(ب) الإدارة المركزية للتعاون الدولي","cod":"0704000000","Children":[]},{"ID":36,"name":"الادارة المركزية للتعريفه /القيمه / المنشأ","cod":"0705000000","Children":[]},{"ID":37,"name":"(د) الإدارة المركزية للتحكيم","cod":"0706000000","Children":[]},{"ID":38,"name":"(هـ) الإدارة المركزية للإعفاءات والنظم الخاصة","cod":"0707000000","Children":[]}]},{"ID":8,"cod":"800000000","name":"قطاع العمليات الجمركية","Children":[{"ID":39,"name":"(أ) الإدارة المركزية لبرنامج المشغل الاقتصادى المعتمد","cod":"0801000000","Children":[]},{"ID":40,"name":"(ب) الإدارة المركزية لدعم البرامج","cod":"0802000000","Children":[]},{"ID":41,"name":"(ج) الإدارة المركزية للمنطقة الشمالية والغربية","cod":"0803000000","Children":[]},{"ID":42,"name":"(د) الإدارة المركزية للمنطقة الوسطى والجنوبية","cod":"0804000000","Children":[]},{"ID":43,"name":"(هـ) الإدارة المركزية للمنطقة الشرقية","cod":"0805000000","Children":[]}]}]
/** Flat node with expandable and level information */
interface ExampleFlatNode {
  expandable: boolean;
  name: string;
  level: number;
}

@Component({
  selector: 'ngx-tree',
  templateUrl: './tree.component.html',
  styleUrls: ['./tree.component.scss']
})
export class TreeComponent implements OnInit {
  
    private _transformer = (node: FoodNode, level: number) => {
        return {
          expandable: !!node.Children && node.Children.length > 0,
          name: node.name,
          level: level,
        };
      }
    
      treeControl = new FlatTreeControl<ExampleFlatNode>(
          node => node.level, node => node.expandable);
    
      treeFlattener = new MatTreeFlattener(
          this._transformer, node => node.level, node => node.expandable, node => node.Children);
    
      dataSource = new MatTreeFlatDataSource(this.treeControl, this.treeFlattener);
    
      constructor() {
        this.dataSource.data = TREE_DATA;
      }
    ngOnInit(): void {
        throw new Error('Method not implemented.');
    }
    
      hasChild = (_: number, node: ExampleFlatNode) => node.expandable;
}
